/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   unset.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bolee <bolee@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/23 14:58:23 by bolee             #+#    #+#             */
/*   Updated: 2022/12/13 14:18:13 by bolee            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../../include/minishell.h"

/*
	key가 없는 key일 경우
	=> 아무 작동도 하지 않음
*/
void	builtin_unset(char *key)
{
	delete_item_by_key(g_global.envp, key);
}
